{
  "chandra": [
    {
      "imgUrl": "https://avatar.iran.liara.run/public",
      "reviewText": "We really liked this accommodation. The staff was extremely nice and always happy to help and advise us with everything. We especially have to thank our driver Kantu who spent 2 days with us and it was amazing, we learned a lot of information about Bali and he was a great guide. And the lovely Ira who arranged everything for us. The environment was absolutely great, quiet and beautiful place. We had a great time.",
      "date": "Mar 24"
    },
    {
      "imgUrl": "https://avatar.iran.liara.run/public",
      "reviewText": "I stayed 4 nights here and had a truly magical experience. From arrival, the villas are a relatively short walk from the road but the stafff were there ready to take my bags for me. On arrival we were given a quick brief on how it all works and ordered room service. Mornings are spectacular from Chandra villa with sunrise and the mountains announcing themselves from the clouds. The local farmers ducks make their way across the rice fields and it’s truly everything you’d expect. The room is clean beds super comfortable. But don’t forget you’re literally in the middle of the jungle. Bugs, mosquitos, lizards and geckos and the occasional dog may be seen. The net around the bed helped a lot and surprising only the 1 mosquito bite between us. Most of all tho, the staff were incredible. Ira was hosting us and went above and beyond anything I asked from her. 10/10 from all aspects of this place.",
      "date": "Mar 24"
    }
  ],
  "surya": [
    {
      "imgUrl": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1a/f6/eb/43/default-avatar-2020-11.jpg?w=100&h=-1&s=1",
      "reviewText": "This was probably the most magical place I have ever stayed. The views and the pool/room are simply perfect. The staff was super accommodating and so kind. Ira greeted us and was available on WhatsApp for any questions. This is a bit of a secluded location so we hired Kantu and he took us to a bunch of great spots for the day; waterfall, rice terrace, market, etc.\n At night the surroundings are so peaceful. The frogs and living creatures in the forest are active and lull you to sleep. The pool was nice and cool so we used it in the afternoon and evening and the backdrops and views are just incredible. \n This really is a hidden gem and I can’t wait to go back with a friend or two and rent the larger villa and stay longer. It was just magical. Thank you. ❤️",
      "date": "Feb 24"
    },
    {
      "imgUrl": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1a/f6/ec/3d/default-avatar-2020-1.jpg?w=100&h=-1&s=1",
      "reviewText": "The greatest experience in Bali! We had a beautiful private villa with infinity pool. Breakfast is served on time and ordered according to our liking. They offer in-house lunch and dinner on request and even massage therapists that have golden hands! The manager, Ira and all the staff are exceptional and so so caring! I wanted to bring a private chef to our villa as a surprise for my mom and Ira and the staff went above and beyond to make our dinner an experience we will never forget. If I'm ever back in Bali, for sure i will visit again!",
      "date": "Jun 23"
    }
  ],
  "jala": [
    {
      "imgUrl": "https://lh3.googleusercontent.com/a-/ALV-UjU2wPRF4w1YdRlISqOTQ6-i8mv2MLrdEfHqAFU0jbb-FEqz8oow=s40-c-rp-mo-br100",
      "reviewText": "A beautiful place nested in rice terraces; incredible view, peace, and quiet. Totally recommend for any kind of break and retreat. I will go back for sure :) The staff is incredibly helpful and friendly, if you are looking to book a Villa around Ubud, you can't go wrong with this one!",
      "date": "Jan 24"
    },
    {
      "imgUrl": "https://lh3.googleusercontent.com/a-/ALV-UjU2wPRF4w1YdRlISqOTQ6-i8mv2MLrdEfHqAFU0jbb-FEqz8oow=s40-c-rp-mo-br100",
      "reviewText": "Masakali Retreat was an amazing experience, we stayed in Jala and the scenery was breathtaking, the amenities were great but most importantly the people were outstanding. Ira and her team were incredibly accommodating and constantly on standby for any questions or concerns. They organised activities for us around Ubud and transport for anywhere we needed to go, thanks to the best driver around, Kantu. The food at Masakali was great including the daily complementary breakfasts which was exactly what we needed after our travels. What I enjoyed the most from our experience here was talking to the local Kelusa people, they were more than happy to share their culture and language. It was nice to be far away from touristic areas and really surround ourselves in the environment. We also had the pleasure of getting to know the resident cat Freya, they kept us company when we were relaxing at the villa. Endless appreciation and thank yous to the team at Masakali Retreat.",
      "date": "Jun 23"
    }
  ],
  "akasha": [
    {
      "imgUrl": "https://lh3.googleusercontent.com/a-/ALV-UjXcXl0Zi9DqF5U-QRYp4r8LJ6YwztHosZNQ13Evr8F8AMVCYIxp=s40-c-rp-mo-br100",
      "reviewText": "Masakali was an excellent retreat villa for the honeymoon of my wife and I. The staff was incredibly attentive, helpful, and friendly, helping us plan day excursions, rent a scooter, book an in-house massage, and hosting a romantic dinner in the villa (which was delicious). The Akasha house is new and incredibly-designed and well done. There are 3 bedrooms, so a couple could definitely move to a smaller villa if desired. Guests should know before booking that this villa is open air, so you will see and hear the sounds of the jungle right outside the living room and dining room. The villa had incredibly views over a rice paddy and jungle valley. The attentive staff is really what made this stay unforgettable. Would highly recommend!",
      "date": "Dec 24"
    },
    {
      "imgUrl": "https://avatar.iran.liara.run/public",
      "reviewText": "Masakali Retreat was by far my favorite accommodation in Bali. We stayed in Bali for 2 weeks and stayed at 5 different places. Ira and her team were amazing. Every request was quickly met. They went above and beyond in every detail. I requested a romantic dinner one night. Ira and her team set up candles and a table by the pool, so we could watch the sunset while we ate. No detail was missed. Kantu drove us around and was a great tour guide. We really enjoyed getting to know him. Our villa was very clean. The staff was very attentive. We loved being immersed in nature right in a working rice field. We truly enjoyed ourselves and we will recommend Masakali Retreat to anyone traveling to Ubud.",
      "date": "Apr 23"
    }
  ],
  "lakshmi": [
    {
      "imgUrl": "https://lh3.googleusercontent.com/a-/ALV-UjXcXl0Zi9DqF5U-QRYp4r8LJ6YwztHosZNQ13Evr8F8AMVCYIxp=s40-c-rp-mo-br100",
      "reviewText": "Our stay in this woody villa, set against the backdrop of the stunning rice fields, was nothing short of magical. Special thanks to IRA and her exceptional staff for their kindness and impeccable service that made our stay unforgettable. The private pool was an absolute delight, and enjoying breakfast on the net was a unique pleasure. Words can hardly capture the beauty of this place. On a scale of 1 to 10, we'd rate it a thousand! Thank you for a remarkable experience! Safouane and Chayma",
      "date": "Oct 24"
    },
    {
      "imgUrl": "https://avatar.iran.liara.run/public",
      "reviewText": "Thank you Ira for this fabulous stay. Masakali Retreat was a wonderful experience for us: The hotel is located in a quiet location, surrounded by rice fields and nature close to Ubud. The service was impeccable, the room and pool was cleaned every day and we were able to wash our laundry. We were able to enjoy our holiday thanks to the kindness of Ira and his team, thank you again.",
      "date": "Nov 24"
    }
  ]
}
